perf-tests/results_v2_20260420_170456/vt/vegeta_customers_5k.txt
Requests      [total, rate, throughput]         40797, 1348.32, 592.65
Duration      [total, attack, wait]             44.368s, 30.258s, 14.111s
Latencies     [min, mean, 50, 90, 95, 99, max]  241.584µs, 11.049s, 9.934s, 26.657s, 30s, 30.002s, 30.024s
Bytes In      [total, mean]                     19826430, 485.98
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           64.45%
Status Codes  [code:count]                      0:14502  200:26295  
Error Set:
Get "http://localhost:8081/customers": dial tcp 0.0.0.0:0->127.0.0.1:8081: bind: can't assign requested address
Get "http://localhost:8081/customers": read tcp 127.0.0.1:51410->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:51401->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:51931->127.0.0.1:8081: read: operation timed out
Get "http://localhost:8081/customers": dial tcp 0.0.0.0:0->127.0.0.1:8081: connect: operation timed out
Get "http://localhost:8081/customers": read tcp [::1]:58685->[::1]:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:52680->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:52681->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:52682->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:52685->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:52686->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:52689->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:52697->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:50985->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:51444->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:51409->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:51407->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:51405->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:51406->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:51404->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:51402->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:49312->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:49568->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:52698->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:52701->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:58339->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:58854->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:58399->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp [::1]:58862->[::1]:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:65135->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:58663->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp [::1]:58680->[::1]:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:50441->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:49573->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:51312->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp [::1]:58874->[::1]:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:58669->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:49570->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:49535->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:49531->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:51327->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:51329->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:51330->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:51314->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:51443->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:51442->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:49530->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:51400->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:51343->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:51346->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:51347->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:50798->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:49686->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:49687->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:51205->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:51200->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:51325->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:58519->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:58560->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:58660->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:52687->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:52692->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:52695->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:52693->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:58806->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:50996->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:50990->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:50972->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:49297->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:51279->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:49529->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:49703->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:49689->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:49695->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:49697->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:49694->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:49692->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:49691->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:49690->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp [::1]:58662->[::1]:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:50997->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:52690->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:52691->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:51199->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:50802->127.0.0.1:8081: read: connection reset by peer
read tcp 127.0.0.1:58210->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:51138->127.0.0.1:8081: read: connection reset by peer
read tcp 127.0.0.1:50378->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:49911->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:49897->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:50987->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:51344->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:50850->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:51342->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:50812->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:50809->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:50804->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:49909->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:49896->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:49902->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": EOF
Get "http://localhost:8081/customers": read tcp 127.0.0.1:51985->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:51774->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:49906->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:51336->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:49278->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:58005->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:50810->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:50806->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:51233->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:50989->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:49900->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:49892->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp [::1]:58559->[::1]:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:51322->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:51204->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:51210->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:51190->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:51203->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:51339->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:51773->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp [::1]:58723->[::1]:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:58595->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:50796->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:51006->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:50998->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:50805->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:65524->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:51982->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:51201->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:58403->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:50493->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:50567->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:50803->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:49901->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:51294->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:65522->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:50591->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:50857->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:52015->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:51940->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:51939->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:63947->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:63944->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:63821->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:63820->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:52025->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:63948->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:63823->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:63841->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:63409->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp [::1]:56903->[::1]:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:63287->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:63918->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:56904->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp [::1]:56781->[::1]:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:63656->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:64115->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:63506->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:63310->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:63535->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:63393->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:62929->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:63900->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:63880->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:63505->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:63206->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:63700->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:63089->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:63239->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:62760->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": context deadline exceeded (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8081/customers": read tcp 127.0.0.1:54586->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:52847->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:59873->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:59877->127.0.0.1:8081: read: connection reset by peer
Get "http://localhost:8081/customers": read tcp 127.0.0.1:54069->127.0.0.1:8081: read: connection reset by peer
context deadline exceeded (Client.Timeout or context cancellation while reading body)